app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-03-28 23:20:04.801071"], ["id", 1]]
---
  def update
    puts params
    @article = Article.find(params[:id])
    @article.update(title: params[:article][:title], description: params[:article][:description])